Revit 2027 API
FormatOptions.CanHaveSymbol(ForgeTypeId) Method
 Checks whether a symbol can be specified to display a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanHaveSymbol(
	ForgeTypeId unitTypeId
)
Public Shared Function CanHaveSymbol (
	unitTypeId As ForgeTypeId
) As Boolean
public:
static bool CanHaveSymbol(
	ForgeTypeId^ unitTypeId
)
static member CanHaveSymbol :
        unitTypeId : ForgeTypeId -> bool
Parameters
unitTypeId ForgeTypeId
 Identifier of the unit.
Return Value
Boolean
 True if a symbol can be specified, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormatOptions Class
CanHaveSymbol Overload
Autodesk.Revit.DB Namespace